{
    "players": [
        {
            "name": "Tua Tagovailoa",
            "position": "Quarterback",
            "school": "Ala",
            "age": "22",
            "height": "6'0\"",
            "weight": "217",
            "trade": "",
            "round": "1",
            "roundPick": "5",
            "overallPick": "5",
            "nflGrade": "6.77",
            "espnGrade": "93",
            "citeLink": "https://www.nfl.com/prospects/tuanigamanuolepola-tagovailoa?id=32195441-4762-0344-3a46-269f5e5e854e",
            "citeText": "Photo and Analysis Taken from NFL.com",
            "image": "https://imagecomposer.nfl.com/?l=http://static.nfl.com/static/content/static/img/combine/2020/headshots/1400x1000/2564071.png&f=png&w=308&c=71",
            "analysis": "Talented dual-threat quarterback with winning background, explosive production and loads of experience in high-leverage games. He may be pigeon-holed into a spread or RPO-heavy attack, but he's actually a clean fit in a pro-style attack filled with play-action and roll-outs. He has the release, accuracy and touch needed to work all three levels successfully and can become a more disciplined, full-field reader to piece the puzzle together against NFL coverages. He needs better poise when pressured, but his escapability not only moves the chains, it creates chunk plays in the air and on the ground. Teams assessing his draft value will need to sift through mounting durability concerns and decide whether he is a \"face of the franchise\" talent without the abundance of talent surrounding him."
        },
        {
            "name": "Austin Jackson",
            "position": "Offensive Tackle",
            "school": "USC",
            "age": "20",
            "height": "6'5\"",
            "weight": "322",
            "trade": "",
            "round": "1",
            "roundPick": "18",
            "overallPick": "18",
            "nflGrade": "6.34",
            "espnGrade": "84",
            "citeLink": "https://www.nfl.com/prospects/austin-jackson?id=32194a41-4304-1754-a4d4-5902e423feaa",
            "citeText": "Photo and Analysis Taken from NFL.com",
            "image": "https://imagecomposer.nfl.com/?l=http://static.nfl.com/static/content/static/img/combine/2020/headshots/1400x1000/2563941.png&f=png&w=308&c=71",
            "analysis": "Early-entry tackle prospect who is raw but gifted and is likely to be coveted by a variety of teams, thanks to his true left tackle traits. Jackson has loads of athletic ability and play talent that is waiting to be developed and harvested. Inconsistent hand placement and footwork could be exploited early on if teams try and rush him into the starting lineup, but issues are correctable. He's scheme-diverse with potential guard flexibility if he improves his strength. He could become an early starter but may offer a wider split between floor and ceiling than some teams might like."
        }
    ]
}
